[
    {
      "bookId": 1,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "imageLink": "https://i.ibb.co/jW3RH3C/1.jpg",
      "longReview": "To Kill a Mockingbird takes readers to the roots of human behavior, to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
      "totalPage": 324,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Legal Drama"],
      "publisher": "Harper Perennial Modern Classics",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "imageLink": "https://i.ibb.co/Y2BjN9s/2.jpg",
      "longReview": "1984 is a dystopian novel set in Airstrip One, formerly Great Britain, a province of the superstate Oceania. The ruling Party, led by the enigmatic Big Brother, exercises totalitarian control over truth, language, and thought. Winston Smith works for the Party rewriting historical records, but he harbors rebellious thoughts. His illicit affair with Julia and his fascination with the Brotherhood, an underground organization dedicated to overthrowing the Party, lead him into a desperate struggle for survival and sanity.",
      "totalPage": 328,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Dystopian", "Satire"],
      "publisher": "Signet Classics",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "imageLink": "https://i.ibb.co/VM13dGr/3.jpg",
      "longReview": "The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted 'gin was the national drink and sex the national obsession,' it is an exquisitely crafted tale of America in the 1920s.",
      "totalPage": 180,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Romance", "Tragedy"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 4,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "imageLink": "https://i.ibb.co/xH72gSM/4.jpg",
      "longReview": "Pride and Prejudice is a romantic novel by Jane Austen, first published in 1813. The story charts the emotional development of the protagonist, Elizabeth Bennet, who learns the error of making hasty judgments and comes to appreciate the difference between the superficial and the essential. The comedy of the writing lies in the depiction of manners, education, marriage, and money during the British Regency period.",
      "totalPage": 279,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Romance", "Regency"],
      "publisher": "Wordsworth Editions",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 5,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "imageLink": "https://example.com/the-catcher-in-the-rye.jpg",
      "longReview": "The Catcher in the Rye is a novel by J.D. Salinger. A classic novel originally published for adults, it has since become popular among adolescent readers for its themes of teenage angst and alienation. It has been translated into almost all of the world's major languages. Around 250,000 copies are sold each year, with total sales of more than 65 million books.",
      "totalPage": 277,
      "rating": 4.2,
      "category": "Fiction",
      "tags": ["Classic", "Alienation"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 6,
      "bookName": "Moby-Dick",
      "author": "Herman Melville",
      "imageLink": "https://example.com/moby-dick.jpg",
      "longReview": "Moby-Dick is a novel by Herman Melville, first published in 1851. It is widely considered to be a Great American Novel and a treasure of world literature. The story tells the adventures of the wandering sailor Ishmael and his voyage on the whaling ship Pequod, commanded by Captain Ahab. Ishmael soon learns that Ahab has one purpose on this voyage: to seek out and destroy the elusive white whale Moby Dick, a quest that will ultimately lead to disaster.",
      "totalPage": 720,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Adventure","Sea Story"],
      "publisher": "Harper & Brothers",
      "yearOfPublishing": 1851
    },
    {
      "bookId": 7,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "imageLink": "https://example.com/the-hobbit.jpg",
      "longReview": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J.R.R. Tolkien. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book remains popular and is recognized as a classic in children's literature.",
      "totalPage": 310,
      "rating": 4.6,
      "category": "Fantasy",
      "tags": ["Adventure","Quest"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    },{
      "bookId": 8,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "imageLink": "https://example.com/the-lord-of-the-rings.jpg",
      "longReview": "The Lord of the Rings is an epic high-fantasy novel written by English author J.R.R. Tolkien. The story began as a sequel to Tolkien's 1937 fantasy novel The Hobbit, but eventually developed into a much larger work. It was written in stages between 1937 and 1949, with much of it being created during World War II. The Lord of the Rings is one of the best-selling novels ever written, with over 150 million copies sold.",
      "totalPage": 1178,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Epic", "Adventure"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "bookId": 9,
      "bookName": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "author": "C.S. Lewis",
      "imageLink": "https://example.com/the-lion-the-witch-and-the-wardrobe.jpg",
      "longReview": "The Lion, the Witch and the Wardrobe is a fantasy novel for children by C. S. Lewis, published by Geoffrey Bles in 1950. It is the first published and best known of seven novels in The Chronicles of Narnia (1950–1956). Among all the author's books, it is also the most widely held in libraries. Although it was written as well as published first in the series, it is volume two in recent editions, which are sequenced according to Narnia history (the first volume being The Magician's Nephew). Like the others, it was illustrated by Pauline Baynes, and her work has been retained in many later editions.",
      "totalPage": 206,
      "rating": 4.5,
      "category": "Fantasy",
      "tags": ["Adventure", "Magic"],
      "publisher": "Geoffrey Bles",
      "yearOfPublishing": 1950
    }
  ]